In [1]:
import pandas as pd
from sqlalchemy import create_engine
from glob import glob

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()

engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

data_path = "../data/"
irreg_path = "../data/irreg/"

In [2]:
year = 2023
quarter = 1
year, quarter

(2023, 1)

### Begin of Irregular quarter

### Irregular Quarter Plus 1

In [3]:
file_name   = 'P1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', index_col=None)
data_ins

      name
0      AOT
1     CITY
2      FPT
3   GVREIT
4      IRC
5     KTIS
6       MC
7    OISHI
8     PICO
9      SSC
10   TFFIF
11      UV

In [4]:
sr = data_ins["name"]
names = sr.values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV'"

In [5]:
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE name in (%s)
AND ((year = %s AND quarter <= %s + 1)
OR (year = %s - 1 AND quarter > %s + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE name in ('AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV')
AND ((year = 2023 AND quarter <= 1 + 1)
OR (year = 2023 - 1 AND quarter > 1 + 1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [6]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### Irregular Quarter Minus 1

In [7]:
file_name   = 'M1-Stocks.csv'
input_file = irreg_path + file_name
col_names   = ['name']
data_ins = pd.read_csv(input_file, sep=',', index_col=None)
data_ins

      name
0   AEONTS
1      BCT
2    BLAND
3      BTS
4   BTSGIF
5      EPG
6   IMPACT
7    INGRS
8      KYE
9      LHK
10     LPF
11    MACO
12     PTL
13     SFP
14  STANLY
15    TIF1
16    TLGF
17     TMW
18      TR
19    TSTH
20     VGI

In [8]:
sr = data_ins["name"]
names = sr.values.tolist()
in_p = ', '.join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI'"

In [9]:
sql = '''
SELECT name, COUNT(*) 
FROM epss 
WHERE name in (%s)
AND year = %s - 1
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name'''
sql = sql % (in_p, year)
print(sql)

SELECT name, COUNT(*)
FROM epss
WHERE name in ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI')
AND year = 2023 - 1
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [10]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### End of Irregular quarter

### Normal Quarter Stocks

In [11]:
irreg_files = sorted(glob('../data/irreg/*.csv'))
irreg_files

['../data/irreg\\M1-Stocks.csv', '../data/irreg\\P1-Stocks.csv']

In [12]:
col_names = ['name']
df_tmp = pd.concat((pd.read_csv(file) for file in irreg_files), ignore_index=True)
df_tmp

      name
0   AEONTS
1      BCT
2    BLAND
3      BTS
4   BTSGIF
5      EPG
6   IMPACT
7    INGRS
8      KYE
9      LHK
10     LPF
11    MACO
12     PTL
13     SFP
14  STANLY
15    TIF1
16    TLGF
17     TMW
18      TR
19    TSTH
20     VGI
21     AOT
22    CITY
23     FPT
24  GVREIT
25     IRC
26    KTIS
27      MC
28   OISHI
29    PICO
30     SSC
31   TFFIF
32      UV

In [13]:
sr = df_tmp['name']
names = sr.values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV'"

In [16]:
sql = """
SELECT name, COUNT(*) AS quarters 
FROM epss 
WHERE name NOT IN (%s)
AND ((year = %s AND quarter <= %s) OR (year = %s-1 AND quarter >= %s+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name"""
sql = sql % (in_p, year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) AS quarters
FROM epss
WHERE name NOT IN ('AEONTS', 'BCT', 'BLAND', 'BTS', 'BTSGIF', 'EPG', 'IMPACT', 'INGRS', 'KYE', 'LHK', 'LPF', 'MACO', 'PTL', 'SFP', 'STANLY', 'TIF1', 'TLGF', 'TMW', 'TR', 'TSTH', 'VGI', 'AOT', 'CITY', 'FPT', 'GVREIT', 'IRC', 'KTIS', 'MC', 'OISHI', 'PICO', 'SSC', 'TFFIF', 'UV')
AND ((year = 2023 AND quarter <= 1) OR (year = 2023-1 AND quarter >= 1+1))
GROUP BY name
HAVING COUNT(*) < 4
ORDER BY name

In [17]:
df = pd.read_sql(sql, conlt)
df

Empty DataFrame
Columns: [name, quarters]
Index: []

### End of Normal Quarter stocks

### New stocks with less than 4 quarters EPS

In [18]:
#Cannot understand logic
sql = '''
SELECT name, COUNT(*) FROM epss 
WHERE (year = %s AND quarter = %s) 
OR (year = %s-1 AND quarter > %s)
GROUP BY name 
HAVING MAX(quarter) < 4 
ORDER BY name'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name, COUNT(*) FROM epss
WHERE (year = 2023 AND quarter = 1)
OR (year = 2023-1 AND quarter > 1)
GROUP BY name
HAVING MAX(quarter) < 4
ORDER BY name

In [19]:
df_tmp = pd.read_sql(sql, conlt)
df_tmp

Empty DataFrame
Columns: [name, COUNT(*)]
Index: []

### Delete EPSS record that unmatch with Tickers in PortPg

In [20]:
sql = '''
SELECT *
FROM epss E
WHERE E.ticker_id NOT IN
(SELECT id FROM tickers)
'''
df = pd.read_sql(sql, conpg)
df.shape

(0, 14)

In [21]:
rp = conpg.execute(sql)
rp.rowcount

0

In [22]:
sql = '''
SELECT *
FROM epss
'''
epss = pd.read_sql(sql, conlt)
epss.shape

(8021, 14)

In [23]:
sql = '''
SELECT *
FROM tickers
'''
tickers = pd.read_sql(sql, conpg)
tickers.shape

(401, 9)

In [24]:
df_merge = pd.merge(epss, tickers, on='name', how='outer', indicator = True)
df_merge.shape

(8191, 23)

In [25]:
df_left = df_merge[df_merge['_merge'] == 'left_only']
df_left

Empty DataFrame
Columns: [id_x, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date, id_y, full_name, sector, subsector, market, website, created_at, updated_at, _merge]
Index: []

[0 rows x 23 columns]

In [26]:
name_ary = df_left['name'].unique()
name_ary

array([], dtype=object)

In [27]:
sql = '''
SELECT *
FROM epss
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date]
Index: []

### Delete YR_PROFITS record that unmatch with Tickers in PortPg

In [28]:
sql = """
SELECT name, sector, subsector 
FROM tickers
"""
tickers = pd.read_sql(sql, conpg)
tickers.shape

(401, 3)

In [29]:
sql = '''
SELECT *
FROM yr_profits
'''
yr_profits = pd.read_sql(sql, conlt)
yr_profits.shape

(5519, 9)

In [30]:
df_merge = pd.merge(yr_profits, tickers, on="name", how="outer", indicator=True)
df_merge.shape

(5691, 12)

In [31]:
df_left = df_merge[df_merge["_merge"] == "left_only"]
df_left.shape

(0, 12)

In [32]:
name_ary = df_left["name"].unique()
name_ary

array([], dtype=object)

In [33]:
sql = '''
SELECT *
FROM yr_profits
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
errors = pd.read_sql(sql, conlt)
errors

Empty DataFrame
Columns: [id, name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id]
Index: []

In [34]:
sql = '''
DELETE
FROM yr_profits
WHERE name IN (%s)
'''
in_p = ', '.join(map(lambda name: "'%s'" % name, name_ary))
sql = sql % (in_p)
print(sql)

DELETE
FROM yr_profits
WHERE name IN ()

In [35]:
rp = conlt.execute(sql)
rp.rowcount

0

### Profits table

In [36]:
pd.set_option('display.max_rows',None)
sql = '''
SELECT * 
FROM profits
ORDER BY name, year, quarter
'''
profits = pd.read_sql(sql, conmy)
profits

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2591,AH,2023,1,1,1983003,1015701,967302,95.23,1983003,...,561818,402463,159355,39.594944,410711,151107,36.791564,9,45.089127,36.214186
1,2600,AWC,2023,1,1,4630796,2100590,2530206,120.45,4630796,...,1422041,645106,776935,120.435246,1405856,16185,1.151256,699,65.549126,63.858830
2,2584,BBL,2023,1,1,32316817,26702007,5614810,21.03,32316817,...,10129289,7118064,3011225,42.303989,7569465,2559824,33.817767,50,26.857939,14.092700
3,2593,BDMS,2023,1,1,12633281,10040447,2592834,25.82,12633281,...,3470112,3443034,27078,0.786458,3113412,356700,11.456884,54,9.568335,12.005319
4,2592,BEM,2023,1,1,2849148,1040915,1808233,173.72,2849148,...,749125,336162,412963,122.846425,603185,145940,24.194899,57,84.427831,76.660167
5,2587,BH,2023,1,1,5796547,1849587,3946960,213.40,5796547,...,1583366,725041,858325,118.382960,1545891,37475,2.424168,61,87.896782,98.249087
6,2596,EA,2023,1,1,8557738,6054527,2503211,41.34,8557738,...,2319761,1366310,953451,69.782919,2172251,147510,6.790652,148,32.613393,29.025750
7,2597,FPT,2023,2,1,2033577,1684084,349493,20.75,2033577,...,316979,312654,4325,1.383318,314905,2074,0.658611,745,5.750482,10.011356
8,2589,ICHI,2023,1,1,759443,529124,230319,43.53,759443,...,221729,103930,117799,113.344559,192939,28790,14.921815,216,47.539093,45.686389
9,2586,KKP,2023,1,1,7631606,6910731,720875,10.43,7631606,...,2084864,2055354,29510,1.435762,1430050,654814,45.789588,255,14.511338,21.333613
10,2583,KTB,2023,1,1,34983988,24790196,10193792,41.12,34983988,...,10066596,8780344,1286252,14.649221,8109182,1957414,24.138242,258,20.931866,15.812750
11,2582,KTC,2023,1,1,7203836,5992158,1211678,20.22,7203836,...,1871710,1747272,124438,7.121845,1665855,205855,12.357318,259,10.364791,7.866690
12,2595,LANNA,2023,1,1,3126160,1947761,1178399,60.50,3126160,...,780673,615242,165431,26.888769,438389,342284,78.077689,264,42.764114,32.637155
13,2585,LHFG,2023,1,1,1736882,1334969,401913,30.11,1736882,...,669868,511741,158127,30.899811,344754,325114,94.303184,268,41.333249,36.611253
14,2598,OISHI,2023,2,1,1187041,834166,352875,42.30,1187041,...,325685,264766,60919,23.008619,316960,8725,2.752713,338,18.367833,18.312317
15,2590,PTG,2023,1,1,1051660,635044,416616,65.60,1051660,...,277616,160041,117575,73.465549,-3622,281238,7764.715627,381,1979.092794,3857.176630
16,2588,PTTEP,2023,1,1,79663700,37848936,41814764,110.48,79663700,...,19281388,10519023,8762365,83.300179,15610584,3670804,23.514841,384,57.413755,47.134950
17,2601,SAPPE,2023,1,1,774553,477634,296919,62.16,774553,...,274790,153388,121402,79.147000,154340,120450,78.041985,420,59.484746,28.346150
18,2594,TASCO,2023,1,1,3278554,2013621,1264933,62.82,3278554,...,1128167,216124,912043,421.999870,1053887,74280,7.048194,502,132.602016,194.278214
19,2599,TFFIF,2023,2,1,1996055,1209444,786611,65.04,1996055,...,472071,397594,74477,18.731923,472036,35,0.007415,686,21.914834,29.861353
20,2581,TTB,2023,1,1,15294801,10886994,4407807,40.49,15294801,...,4294515,3194904,1099611,34.417654,3847324,447191,11.623430,541,23.570271,16.298783

### End of Delete Profits records